using static System.Console;
Clear();
/////////////////////////////////////////////////////////////////////

/*
Задача 64: 
Задайте значение N. Напишите программу, 
которая выведет все натуральные числа 
в промежутке от N до 1.
N = 5 -> "5, 4, 3, 2, 1"
N = 8 -> "8, 7, 6, 5, 4, 3, 2, 1"

Задача 68: 
Напишите программу вычисления функции Аккермана 
с помощью рекурсии. Даны два неотрицательных числа m и n.
m = 2, n = 3 -> A(m,n) = 9
m = 3, n = 2 -> A(m,n) = 29
*/

int a = 12;
int b = 1;


WriteLine(GetNumber(a, b));

int GetNumber(int a, int b)
{
    if (a == b)
        return a;
    else
        Write($"{GetNumber(a, b + 1)}, ");
    return b;
}

